---
type: FileExportingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# FileExportingEventArgs

`Autodesk.Revit.DB.Events.FileExportingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Format | 2010 | `public ImportExportFileFormat Format { get ; }` |
| Property | Path | 2010 | `public string Path { get ; }` |